# Built In Failures Link Failures Class

Source: https://www.revitapidocs.com/2026/99f8c34f-60bc-2dc8-eb93-c8db7d276e53.htm

---

| Built In Failures Link Failures Class |
| --- |

Failures about LinkFailures. Inheritance Hierarchy System Object
Autodesk.Revit.DB BuiltInFailures LinkFailures

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static class LinkFailures
```

```
Public NotInheritable Class LinkFailures
```

```
public ref class LinkFailures abstract sealed
```

```
[<AbstractClassAttribute>]
[<SealedAttribute>]
type LinkFailures = class end
```
The BuiltInFailures LinkFailures type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | CannotModifyLinkedFile | Shared Sites in the link ""%1!s!"" cannot be modified. |
|  | CannotOpenLinkedFileServerFound | Cannot open the linked model using Open and Unload because the plugin \[name] provided by \[vendor]  experienced an error. For more information please contact \[vendor]. |
|  | CannotOpenLinkedFileServerNotFound | Cannot open the linked model using Open and Unload because the plugin \[name] cannot be accessed. Please check  plugin \[name], which has server Id \[serverId] |
|  | CannotPublishSharedCoordinatesToMirroredNonRevitLinks | Shared coordinates cannot be published to mirrored, non Revit, links. |
|  | CannotReloadFile | Can't reload file. |
|  | CannotReloadNonRvtFileNotFound | Cannot Reload Link because file is not found. Link will remain unchanged in the Document. |
|  | CannotUnlinkFile | Can't unlink file. |
|  | DataDictionaryDifferentInLink | Linked file \[Name] was last saved in a previous version of Revit. Changes to it cannot be saved until it is upgraded. |
|  | DeleteLinkSymbolPrompt | All instances of Linked Model '\[Name]' have been deleted, but the file itself is still loaded.  Remove the Linked File using Manage Links dialog to save memory unless you are going to reuse it in this project.  Removing the Link cannot be undone. |
|  | LinkedFileOpenInOtherDoc | Linked file cannot be reloaded because it is loaded into another open document. |
|  | LinkInstanceNeedsReconcile | Instance of linked .rvt file needs Coordination Review |
|  | ModifiedLinkedFile | Shared Sites in the link have been modified, use move instance to reset the change. |
|  | ModifyingLinkedFile | Shared Locations in the Linked Model '\[Name]' have been modified, but not saved back to the Linked File.  Upon reopening, instances of the Linked Model will return to their last Saved Positions.  You can Save the Linked Model later via the Manage Links dialog. |
|  | MultipleLinks | Can't complete operation. Linked Files have the same name. |
|  | NoConstraintsToLinks1 | Constraints may not be created to linked instances using Shared Locations. Constraints will be removed. |
|  | SourceFileDrivenByOtherTarget | Linked Model's Shared Coordinates have been modified via another host model in this session. In order to be able to change the Linked File via the active host model, Save and open it again in a new session. |
|  | WatchedLinkMoved | Monitored Link moved. |

Top See Also

#### Reference

Autodesk.Revit.DB Namespace